src/bsl/Documents/гкс_ЗаписьВГрафикОтгрузкиПЛК.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>гкс_ЗаписьВГрафикОтгрузкиПЛК</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.гкс_ГрафикОтгрузкиПЛК</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ТочкаМаршрута</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.гкс_ТочкиМаршрута</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Номенклатура</Name>
					<Comment>ERP-981</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НачалоПериода</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОкончаниеПериода</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоличествоТранспортныхСредствВЧас</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоличествоТранспортныхСредствВЧасПоЭО</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Отменено</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Document>
</MetaDataObject>

src/bsl/InformationRegisters/гкс_ОчередьОтгрузкиПЛК.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>гкс_ОчередьОтгрузкиПЛК</Name>
			<Comment>Очередь отгрузки транспортных средств на ПЛК</Comment>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Договор</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НомерТранспортногоСредства</Name>
					<Comment>Номер транспортного средства</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>15</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>НачалоПериода</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ОкончаниеПериода</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/bsl/InformationRegisters/гкс_ГрафикОтгрузкиПЛК.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>гкс_ГрафикОтгрузкиПЛК</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>КоличествоТранспортныхСредствВЧас</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КоличествоТранспортныхСредствВЧасПоЭО</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>НачалоПериода</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ОкончаниеПериода</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/bsl/Documents/гкс_ЗаписьВГрафикОтгрузкиПЛК/Ext/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
			
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;

	ОбновлениеИнформационнойБазы.ПроверитьОбъектОбработан(ЭтотОбъект);
	
	гкс_ПроведениеДокументов.ПередЗаписьюДокумента(ЭтотОбъект, РежимЗаписи, РежимПроведения);
	
	Если РежимЗаписи = РежимЗаписиДокумента.ОтменаПроведения Тогда
		ПроверитьСвязанныеЗаписиВОчередь(Отказ);
	КонецЕсли; 
	
	ПроверитьЗаполнениеОбъектаПередЗаписью(Отказ);
	ЗаполнитьДополнительныеСвойстваОбъекта();
	
	Если РежимЗаписи = РежимЗаписиДокумента.Проведение И ДополнительныеСвойства.Свойство("ЗаписьИзФормы") Тогда
		ПроверитьДоступностьМестВГрафикеИОчереди(Отказ);
	КонецЕсли;
			
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, Режим)
	
	гкс_ПроведениеДокументов.ОбработкаПроведенияДокумента(ЭтотОбъект, Отказ);
	
КонецПроцедуры

Процедура ОбработкаУдаленияПроведения(Отказ)
	
	гкс_ПроведениеДокументов.ОбработкаУдаленияПроведенияДокумента(ЭтотОбъект, Отказ);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ПроверитьСвязанныеЗаписиВОчередь(Отказ)
	
	Если ЕстьЗаписиВОчередиОтгрузки() И Не Отменено Тогда		
		ОбщегоНазначения.СообщитьПользователю(
			СтрШаблон(НСтр("ru = 'На основании графика %1 уже оформлены записи в очередь'"), Ссылка), , , , Отказ);
	КонецЕсли;
		
КонецПроцедуры
 
Процедура ЗаполнитьДополнительныеСвойстваОбъекта()
	
	Если ЭтоНовый() Тогда
		Возврат;
	КонецЕсли;
	
	СохраненныеДанные = ДанныеДокумента();
	ИзмененияДокумента = ИзмененияДокумента(СохраненныеДанные);

	ДополнительныеСвойства.Вставить("СохраненныеДанные", СохраненныеДанные);
	ДополнительныеСвойства.Вставить("ИзмененияДокумента", ИзмененияДокумента);
			
КонецПроцедуры

Функция ДанныеДокумента()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ТаблицаДокумента.НачалоПериода КАК НачалоПериода,
	|	ТаблицаДокумента.ОкончаниеПериода КАК ОкончаниеПериода,
	|	ТаблицаДокумента.КоличествоТранспортныхСредствВЧас КАК КоличествоТранспортныхСредствВЧас,
	|	ТаблицаДокумента.КоличествоТранспортныхСредствВЧасПоЭО КАК КоличествоТранспортныхСредствВЧасПоЭО
	|ИЗ
	|	Документ.гкс_ЗаписьВГрафикОтгрузкиПЛК КАК ТаблицаДокумента
	|ГДЕ
	|	ТаблицаДокумента.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Выборка.Следующий();
	
	ДанныеДокумента = Новый Структура;
	ДанныеДокумента.Вставить("НачалоПериода");
	ДанныеДокумента.Вставить("ОкончаниеПериода");
	ДанныеДокумента.Вставить("КоличествоТранспортныхСредствВЧас");
	ДанныеДокумента.Вставить("КоличествоТранспортныхСредствВЧасПоЭО");
	
	ЗаполнитьЗначенияСвойств(ДанныеДокумента, Выборка); 
	
	Возврат ДанныеДокумента;
	
КонецФункции

Процедура ПроверитьЗаполнениеОбъектаПередЗаписью(Отказ)
	
	ЧасовойПояс = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ТочкаМаршрута, "гкс_ЧасовойПоясТочкиМаршрута");
	
	Если Не гкс_ЭлектроннаяОчередь.ДатаЗаявкиАктуальна(ОкончаниеПериода, ЧасовойПояс) И Не Отказ Тогда
	
		ОбщегоНазначения.СообщитьПользователю(НСтр("ru = 'Запрещено вносить записи в прошлые периоды!'"),
		                                                  Неопределено, "ОкончаниеПериода", "", Отказ);
														  
	КонецЕсли;
	   	
КонецПроцедуры

#Область РасчетИзмененийДокумента

Функция ЕстьИзменения()
	
	Перем ИзмененияДокумента;
	
	ДополнительныеСвойства.Свойство("ИзмененияДокумента", ИзмененияДокумента);
	
	Если НЕ ЗначениеЗаполнено(ИзмененияДокумента) Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Возврат ИзмененияДокумента.Свойство("ЕстьИзменениеНачалоПериода")
	        ИЛИ ИзмененияДокумента.Свойство("ЕстьИзменениеОкончаниеПериода")
	       	ИЛИ ИзмененияДокумента.Свойство("ЕстьИзменениеКоличествоТС");
			

КонецФункции

Функция ИзмененияДокумента(СохраненныеДанные) 
	
	ИзмененияДокумента = Новый Структура;
	
	Если НЕ СохраненныеДанные.НачалоПериода = НачалоПериода Тогда
		
		ИзмененияДокумента.Вставить("ЕстьИзменениеНачалоПериода");
		
		ДобавитьПериодКонтроляИзменений(ИзмененияДокумента, 
		                                СохраненныеДанные.НачалоПериода, 
						                НачалоПериода);
										
	КонецЕсли;
	
	Если НЕ СохраненныеДанные.ОкончаниеПериода = ОкончаниеПериода Тогда
		
		ИзмененияДокумента.Вставить("ЕстьИзменениеОкончаниеПериода");
		ДобавитьПериодКонтроляИзменений(ИзмененияДокумента, 
		                                СохраненныеДанные.ОкончаниеПериода, 
						                ОкончаниеПериода);

	КонецЕсли;
	
	Если НЕ СохраненныеДанные.КоличествоТранспортныхСредствВЧас = КоличествоТранспортныхСредствВЧас 
		ИЛИ НЕ СохраненныеДанные.КоличествоТранспортныхСредствВЧасПоЭО = КоличествоТранспортныхСредствВЧасПоЭО Тогда
		
		ИзмененияДокумента.Вставить("ЕстьИзменениеКоличествоТС");
		ДобавитьПериодКонтроляИзменений(ИзмененияДокумента, 
		                                НачалоПериода, 
						                ОкончаниеПериода);
		
	КонецЕсли;

    Возврат ИзмененияДокумента;
	
КонецФункции

Процедура ДобавитьПериодКонтроляИзменений(ИзмененияДокумента, Дата1, Дата2)
	
	Если НЕ ИзмененияДокумента.Свойство("ПериодыКонтроля") Тогда
		
		ПериодыКонтроля = Новый ТаблицаЗначений;
		ПериодыКонтроля.Колонки.Добавить("НачалоПериода", Новый ОписаниеТипов("Дата"));
		ПериодыКонтроля.Колонки.Добавить("КонецПериода", Новый ОписаниеТипов("Дата"));
		
		ИзмененияДокумента.Вставить("ПериодыКонтроля", ПериодыКонтроля);	
		
	КонецЕсли;
	
	ПериодКонтроля = ИзмененияДокумента.ПериодыКонтроля.Добавить();
	ПериодКонтроля.НачалоПериода = ?(Дата1 > Дата2, Дата2, Дата1);
	ПериодКонтроля.КонецПериода =  ?(Дата1 > Дата2, Дата1, Дата2);
	
КонецПроцедуры

#КонецОбласти

#Область ДоступностьОчередей

Процедура ПроверитьДоступностьМестВГрафикеИОчереди(Отказ)
	
	Если НЕ ЕстьСвободноеМестоВГрафике() Тогда
		
		ТекстСообщения = НСтр("ru = 'На этот период в графике отгрузки уже существуют записи!'");
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения, Неопределено, "ОкончаниеПериода", "", Отказ);
												  
	КонецЕсли;
											  
	Если НЕ ЕстьСвободноеМестоВОчереди() Тогда
		
		ТекстСообщения = НСтр("ru = 'На этот период в очередь отгрузки уже есть запись!'");
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения, Неопределено, "ОкончаниеПериода", "", Отказ);
												  
	КонецЕсли;
	
КонецПроцедуры

Функция ЕстьСвободноеМестоВОчереди()
	
	// Если есть изменения количества не меняли ничего остального то проверяем сам интервал
	// Проверка дат
	// 1) (+НачалоПериода) НачалоПериодаСтарое НчалоПериодаНовое
	// 2) (-НачалоПериода) НачалоПериодаНовое НачалоПериодаСтарое 
	// 3) (+КонецПериода) КонецПериодаСтарый КонецПериодаНовый
	// 4) (-КонецПериода) КонецПериодаНовый КонецПериодаСтарый 
	
	Если ЭтоНовый() Тогда
		Возврат Не ЕстьЗаписиВОчередиОтгрузки();
	КонецЕсли;
	
	Если НЕ ЕстьИзменения() Тогда
		Возврат Истина;
	КонецЕсли;
	
	Возврат ЕстьСвободноеМестоВОчередиДляИзмененнойЗаписи();	
	
КонецФункции

Функция ЕстьСвободноеМестоВОчередиДляИзмененнойЗаписи()
	
	ПараметрыЗаписиВОчередь = Новый Структура;	
	ПараметрыЗаписиВОчередь.Вставить("Номенклатура", Номенклатура);
	ПараметрыЗаписиВОчередь.Вставить("Периоды", ДополнительныеСвойства.ИзмененияДокумента.ПериодыКонтроля);
	
	УстановитьБлокировкуОчередиПоПараметрам(ПараметрыЗаписиВОчередь);
	
	Возврат Не РегистрыСведений.гкс_ОчередьОтгрузкиПЛК.ЕстьЗаписьВОчередь(ПараметрыЗаписиВОчередь);
	
КонецФункции

Функция ЕстьЗаписиВОчередиОтгрузки()
	
	ПараметрыЗаписиВОчередь = Новый Структура;
	ПараметрыЗаписиВОчередь.Вставить("НачалоПериода", НачалоПериода);
	ПараметрыЗаписиВОчередь.Вставить("ОкончаниеПериода", ОкончаниеПериода);
	ПараметрыЗаписиВОчередь.Вставить("Номенклатура", Номенклатура);
	
	УстановитьБлокировкуОчередиПоПараметрам(ПараметрыЗаписиВОчередь);
	
	Возврат РегистрыСведений.гкс_ОчередьОтгрузкиПЛК.ЕстьЗаписьВОчередь(ПараметрыЗаписиВОчередь);
	
КонецФункции

Функция ЕстьСвободноеМестоВГрафике()
		           
	ДанныеГрафика = Новый Структура;
	
	ДанныеГрафика.Вставить("Номенклатура", Номенклатура);
	ДанныеГрафика.Вставить("НачалоПериода", НачалоПериода);
	ДанныеГрафика.Вставить("ОкончаниеПериода", ОкончаниеПериода);
	
	УстановитьБлокировкуГрафикаПоПараметрам(ДанныеГрафика);
	
	Если НЕ ЭтоНовый() Тогда
		ДанныеГрафика.Вставить("Ссылка", Ссылка);	
	КонецЕсли;
	
	Период = Новый Структура("ДатаНачала, ДатаОкончания", НачалоПериода, ОкончаниеПериода);
	
	Возврат РегистрыСведений.гкс_ГрафикОтгрузкиПЛК.ЕстьСвободноеМесто(Период, Номенклатура, Ссылка);
	
КонецФункции

#КонецОбласти

#Область Блокировки

Процедура УстановитьБлокировкуОчередиПоПараметрам(Параметры)
	
	Блокировка = Новый БлокировкаДанных;
	
	Если Параметры.Свойство("Периоды") Тогда
		
		Для Каждого Период Из Параметры.Периоды Цикл
			Диапазон = Новый Диапазон(Период.НачалоПериода, Период.КонецПериода);
			ДобавитьЭлементБлокировкиОчереди(Блокировка, Параметры.Номенклатура, Диапазон);
		КонецЦикла;	
	Иначе		
		Диапазон = Новый Диапазон(Параметры.НачалоПериода, Параметры.ОкончаниеПериода);
		ДобавитьЭлементБлокировкиОчереди(Блокировка, Параметры.Номенклатура, Диапазон);												  
	КонецЕсли;
	
	Блокировка.Заблокировать();

КонецПроцедуры

Процедура ДобавитьЭлементБлокировкиОчереди(Блокировка, Номенклатура, Диапазон)
	
	ЭлементБлокировки = Блокировка.Добавить("РегистрСведений.гкс_ОчередьОтгрузкиПЛК");
	ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
	ЭлементБлокировки.УстановитьЗначение("Номенклатура", Номенклатура);
	ЭлементБлокировки.УстановитьЗначение("НачалоПериода", Диапазон);
	ЭлементБлокировки.УстановитьЗначение("ОкончаниеПериода", Диапазон);
	
КонецПроцедуры

Процедура УстановитьБлокировкуГрафикаПоПараметрам(Параметры)
	
	Диапазон = Новый Диапазон(Параметры.НачалоПериода, Параметры.ОкончаниеПериода);
	
	Блокировка = Новый БлокировкаДанных;
	
	ЭлементБлокировки = Блокировка.Добавить("РегистрСведений.гкс_ГрафикОтгрузкиПЛК");
	ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
	ЭлементБлокировки.УстановитьЗначение("Номенклатура", Параметры.Номенклатура);
	ЭлементБлокировки.УстановитьЗначение("НачалоПериода", Диапазон);
	ЭлементБлокировки.УстановитьЗначение("ОкончаниеПериода", Диапазон);
	
	Блокировка.Заблокировать();

КонецПроцедуры

#КонецОбласти

#КонецОбласти

#Иначе
ВызватьИсключение НСтр("ru='Недопустимый вызов объекта на клиенте'", ОбщегоНазначенияКлиентСервер.КодОсновногоЯзыка());
#КонецЕсли
